benchmark/FieldExamples/curveSurfaceMappingCaratOF/OF/constant/EmpireDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

densityFluid   densityFluid [ 1 -3 0 0 0 0 0 ] 1.2250;

FSIInterfaces (
	airfoil {
		patchNames (airfoil);
                numSections 20;
                numRootSectionNodes 10;
                numNormalSectionNodes 10;
                numTipSectionNodes 10;
                rotationGlobal2Root (1 0 0 0 1 0 0 0 1);
                translationGlobal2Root (0 0 0);
	}
);

// ************************************************************************* //
